running_app/app/controllers/running_blogs_controller.rb

  def index
    @running_blogs = RunningBlog.all
---
SELECT "running_blogs".* FROM "running_blogs"

  def create
    @running_blog = RunningBlog.new(running_blog_params)

    respond_to do |format|
      if @running_blog.save
---
INSERT INTO "running_blogs" ("title", "author", "date", "content", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @running_blog.update(running_blog_params)
---
UPDATE "running_blogs" SET "content" = $1, "updated_at" = $2 WHERE "running_blogs"."id" = $3  [["content", "I want to write about my training plan that is coming up. We have liftoff!!!"], ["updated_at", "2019-10-27 04:35:45.603510"], ["id", 1]]

    def set_running_blog
      @running_blog = RunningBlog.find(params[:id])
---
SELECT "running_blogs".* FROM "running_blogs" WHERE "running_blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]